In [1]:
import numpy as np
import pandas as pd

In [2]:
dictionary_1 = {"name":["abc", "def", "ghi", "jkl"],
                "marks":[12, 56, 72, 91],
                "cities":["mno", "pqr", "stu", "vwx"]}

In [3]:
data_frame = pd.DataFrame(dictionary_1)

In [4]:
data_frame

  name  marks cities
0  abc     12    mno
1  def     56    pqr
2  ghi     72    stu
3  jkl     91    vwx

In this eg, name, marks and cities are column names and 0, 1, 2 and 3 are indices

In [5]:
data_frame.to_csv('data.csv') # Saves the dataframe as a csv file

In [6]:
data_frame.to_csv('data_without_indices.csv', index=False) # Removes te indices and re-saves the dataframe as a csv file

In [7]:
data_frame.head() # returns the first few rows

  name  marks cities
0  abc     12    mno
1  def     56    pqr
2  ghi     72    stu
3  jkl     91    vwx

In [8]:
data_frame.tail() # returns the last few rows

  name  marks cities
0  abc     12    mno
1  def     56    pqr
2  ghi     72    stu
3  jkl     91    vwx

In [9]:
data_frame.head(2) # returns the first 2 rows

  name  marks cities
0  abc     12    mno
1  def     56    pqr

In [10]:
data_frame.tail(2) # returns the last 2 rows

  name  marks cities
2  ghi     72    stu
3  jkl     91    vwx

In [11]:
data_frame.describe() # returs the various centers and measures of spread of the numerica columns of the data

           marks
count   4.000000
mean   57.750000
std    33.688524
min    12.000000
25%    45.000000
50%    64.000000
75%    76.750000
max    91.000000

In [12]:
file_handle = pd.read_csv("data_2.csv")

In [13]:
file_handle

   col1 col2 col3
0   123  abc  pqr
1   456  def  stu
2   789  ghi  vwx

In [17]:
file_handle['col2'][0] # prints the value of col2 where the index == 0

'abc'

In [22]:
file_handle['col2'][0] = 'yz' # changes the value of col2 where the index == 0 to 23

<ipython-input-22-5c73e0eeede3>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  file_handle['col2'][0] = 'yz' # changes the value of col2 where the index == 0 to 23

In [23]:
file_handle

   col1 col2 col3
0   123   yz  pqr
1   456  def  stu
2   789  ghi  vwx

In [25]:
file_handle.to_csv('data_with_val_change.csv')

In [31]:
file_handle.index = ['a', 'b', 'c'] # changes the values of the indices

In [32]:
file_handle

   col1 col2 col3
a   123   yz  pqr
b   456  def  stu
c   789  ghi  vwx

In [33]:
file_handle.index = [0, 1, 2] # changes the values of the indices

In [34]:
file_handle

   col1 col2 col3
0   123   yz  pqr
1   456  def  stu
2   789  ghi  vwx